# Завдання 2

# Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами,
# що випали випадковим чином і в певному діапазоні під час чергового тиражу.
# Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.

# Вам необхідно написати функцію get_numbers_ticket(min, max, quantity),
# яка допоможе генерувати набір унікальних випадкових чисел для таких лотерей.
# Вона буде повертати випадковий набір чисел у межах заданих параметрів,
# причому всі випадкові числа в наборі повинні бути унікальні.

# Вимоги до завдання:

# Параметри функції:
# min - мінімальне можливе число у наборі (не менше 1).
# max - максимальне можливе число у наборі (не більше 1000).
# quantity - кількість чисел, які потрібно вибрати (значення між min і max).
# Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
# Функція повертає список випадково вибраних, відсортованих чисел.
# Числа в наборі не повинні повторюватися.
# Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.


# Рекомендації для виконання:
# Переконайтеся, що вхідні параметри відповідають заданим обмеженням.
# Використовуйте модуль random для генерації випадкових чисел.
# Використовуйте множину або інший механізм для забезпечення унікальності чисел.
# Пам'ятайте, що функція get_numbers_ticket повертає відсортований список унікальних чисел.

import random

def get_numbers_ticket(min: int, max: int, quantity: int) -> list:
    if min < 1 or max > 1000 or max < min or quantity > (max - min + 1):
        return []
    lot_values = random.sample(range(min, max + 1), quantity)
    lot_values.sort()
    return lot_values

try:
    min = int(input('min (>0) >>> '))
    max = int(input('max (<=1000)>>> '))
    quantity = int(input('quantity (<= max-min)>>> '))
except ValueError:
    print('Not correct values !!!')
except:
    print('Something went wrong !!!')
else:
    result = get_numbers_ticket(min, max, quantity)
    if result:
        print(result)
    else:
        print('Error:\n min (>0)\n max (<=1000)\n quantity (<= max-min)')